tutorials/RAE2822/0/T
/*-----------------------------------------------------------------------------------------*\
| =========                 |                                                               |
| \\      /  F ield         | rhoDST: Block-coupled solver for compressible flows           |
|  \\    /   O peration     |                                                               |
|   \\  /    A nd           | Copyright (C) 2020 Design and Simulation Tech. Inc. (DSTECH)  |
|    \\/     M anipulation  | Website:  http://www.dstechno.net/                            |
\*-----------------------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// *************************************************************************************** //
#include        "include/freestreamConditions"

dimensions      [0 0 0 1 0 0 0];

internalField   uniform $TInf;

boundaryField
{
    freestreamBC
    {
        type            farFieldTemperatureDST;
        #include        "include/freestreamConditions"
        value           $internalField;
    }
    
    frontAndBackPlanes
    {
        type            	empty;
    } 

    airfoil
    {
        type            zeroGradient;
    }    
}

// *************************************************************************************** //
