tutorials/RAE2822/0/alphat
/*-----------------------------------------------------------------------------------------*\
| =========                 |                                                               |
| \\      /  F ield         | rhoDST: Block-coupled solver for compressible flows           |
|  \\    /   O peration     |                                                               |
|   \\  /    A nd           | Copyright (C) 2020 Design and Simulation Tech. Inc. (DSTECH)  |
|    \\/     M anipulation  | Website:  http://www.dstechno.net/                            |
\*-----------------------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alphat;
}
// *************************************************************************************** //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    freestreamBC
    {
        type            calculated;
        value           uniform 0;
    }


    frontAndBackPlanes
    {
        type            	empty;
    }     
    
    airfoil
    {
        type            alphatWallFunction;
        Prt             0.85;
        value           uniform 0;
    }    
}


// *************************************************************************************** //
