tutorials/RAE2822/0/epsilon
/*-----------------------------------------------------------------------------------------*\
| =========                 |                                                               |
| \\      /  F ield         | rhoDST: Block-coupled solver for compressible flows           |
|  \\    /   O peration     |                                                               |
|   \\  /    A nd           | Copyright (C) 2020 Design and Simulation Tech. Inc. (DSTECH)  |
|    \\/     M anipulation  | Website:  http://www.dstechno.net/                            |
\*-----------------------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// *************************************************************************************** //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 0.0015;

boundaryField
{
    airfoil
    {
        type            compressible::epsilonWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           uniform 0.0015;
    }
    freestreamBC
    {
        type            	freestream;
        freestreamValue           uniform 0.0015;
    }
    frontAndBackPlanes
    {
        type            empty;
    }
}


// *************************************************************************************** //
