tutorials/RAE2822/0/k
/*-----------------------------------------------------------------------------------------*\
| =========                 |                                                               |
| \\      /  F ield         | rhoDST: Block-coupled solver for compressible flows           |
|  \\    /   O peration     |                                                               |
|   \\  /    A nd           | Copyright (C) 2020 Design and Simulation Tech. Inc. (DSTECH)  |
|    \\/     M anipulation  | Website:  http://www.dstechno.net/                            |
\*-----------------------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// *************************************************************************************** //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.0038;

boundaryField
{
    airfoil
    {
        type            compressible::kqRWallFunction;
        value           uniform 0.0038;
    }
    freestreamBC
    {
        type            	freestream;
        freestreamValue           uniform 0.0038;
    }
    
    frontAndBackPlanes
    {
        type            empty;
    }
}


// *************************************************************************************** //
