tutorials/RAE2822/0/nuTilda
/*-----------------------------------------------------------------------------------------*\
| =========                 |                                                               |
| \\      /  F ield         | rhoDST: Block-coupled solver for compressible flows           |
|  \\    /   O peration     |                                                               |
|   \\  /    A nd           | Copyright (C) 2020 Design and Simulation Tech. Inc. (DSTECH)  |
|    \\/     M anipulation  | Website:  http://www.dstechno.net/                            |
\*-----------------------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nuTilda;
}
// *************************************************************************************** //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 4.4e-05;

boundaryField
{
    freestreamBC
    {
        type            inletOutlet;
        value           uniform 4.4e-05;
        inletValue      uniform 4.4e-05;
    }

    frontAndBackPlanes
    {
        type            	empty;
    }     
    
    airfoil
    {
        type            	fixedValue;
        value           	uniform 0;
    }
}


// *************************************************************************************** //
