tutorials/RAE2822/0/p
/*-----------------------------------------------------------------------------------------*\
| =========                 |                                                               |
| \\      /  F ield         | rhoDST: Block-coupled solver for compressible flows           |
|  \\    /   O peration     |                                                               |
|   \\  /    A nd           | Copyright (C) 2020 Design and Simulation Tech. Inc. (DSTECH)  |
|    \\/     M anipulation  | Website:  http://www.dstechno.net/                            |
\*-----------------------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// *************************************************************************************** //
#include        "include/freestreamConditions"

dimensions      [1 -1 -2 0 0 0 0];


internalField   uniform $pInf;

boundaryField
{
    freestreamBC
    {
        type            farFieldPressureDST;
        #include        "include/freestreamConditions"
        value           $internalField;
    }


    frontAndBackPlanes
    {
        type            	empty;
    }     
 
    airfoil   
    {
        type            zeroGradient;
    }
}


// *************************************************************************************** //
