tutorials/RAE2822/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    frontAndBackPlanes
    {
        type            empty;
        inGroups        1(empty);
        nFaces          47104;
        startFace       46704;
    }
    freestreamBC
    {
        type            patch;
        nFaces          496;
        startFace       93808;
    }
    airfoil
    {
        type            wall;
        inGroups        1(wall);
        nFaces          304;
        startFace       94304;
    }
)

// ************************************************************************* //
