tutorials/RAE2822/system/forces
/*-----------------------------------------------------------------------------------------*\
| =========                 |                                                               |
| \\      /  F ield         | rhoDST: Block-coupled solver for compressible flows           |
|  \\    /   O peration     |                                                               |
|   \\  /    A nd           | Copyright (C) 2020 Design and Simulation Tech. Inc. (DSTECH)  |
|    \\/     M anipulation  | Website:  http://www.dstechno.net/                            |
\*-----------------------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      forces;
}
// *************************************************************************************** //

forces
{
    type            	forceCoeffs;
    functionObjectLibs  ( "libforces.so" );
    outputControl   	timeStep;
    outputInterval 	1;
    patches         	( airfoil );
    pName               p;
    UName               U;
    log             	true;
    rhoInf          	1.48571291822;
    rho             	rhoInf;
    CofR            	( 0 0 0 );
    liftDir     	( -0.0403061842411 0.9991873755767 0 );
    dragDir     	( 0.9991873755767 0.0403061842411 0 );          
    pitchAxis      	(0 0 1);
    magUInf         	233.6216;
    lRef            	1;
    Aref            	1;
} 

// *************************************************************************************** //
